Merge pull request #11 from surprisedcar/feature/deployment
docs: finalize project README
